public class Main {
    public static void main(String[] args) {
        double ticketPrice = 26783;
        int bonusMiles = (int) (ticketPrice / 20);
        System.out.println("Начисленные мили:" + bonusMiles);

        // Объявляете переменные для входных данных и
        // параметров программы: одну для хранения
        // стоимости билета, другую для хранения количества
        // рублей для одной бонусной мили

        // Рассчитываете количество бонусных миль, используя
        // значения заведённых переменных. Ответ сохраняете в
        // новую переменную и выводите на экран
    }
}